---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder
source: html/2e21eed6-6d60-3b08-810b-d4dee43c325a.htm
---
# FieldBuilder Methods

Checks whether the SubSchema GUID needs to be explicitly specified for this field type.